:PROPERTIES:
:ID:       a5407920-3d71-44dd-b50d-1e593bce11a9
:END:
#+TITLE: Python: A simple app for simple man
#+CATEGORY: slips
#+TAGS:

Why not Ruby on Rails? Because =nodejs= happened, more or less.

*** Compose

Services

#+begin_src sh :results output :dir (identity py-proj-root)
# this is a superset of the .services keys in docker-compose.override.yml
find . -name "*compose.yml" -exec yq -y '.services | keys' \{\} +
#+end_src

#+RESULTS:
: - backend
: - celeryworker
: - db
: - flower
: - frontend
: - new-frontend
: - pgadmin
: - proxy
: - queue

The =docker-compose.overrides.yml= specifies these ports

#+begin_src sh :results output :dir (identity py-proj-root)
# .services[] | to_entries | map(select(.key == "ports"))
read -d '' yqscript <<EOF
     .services | to_entries | map({key: .key, value: .value.ports}) | from_entries
EOF

find . -name "*compose.override.yml" -exec \
     yq -y "$yqscript" \{\} +
#+end_src

#+RESULTS:
#+begin_example
proxy:
  - 80:80
  - 8090:8080
pgadmin:
  - 5050:5050
flower:
  - 5555:5555
backend:
  - 8888:8888
celeryworker: null
frontend: null
new-frontend: null
#+end_example

*** src/backend/app/app

#+begin_src sh :results output :dir (identity py-proj-root)
tree -d ./src/backend/app/app
#+end_src

#+RESULTS:
#+begin_example
./src/backend/app/app
├── api
│   └── api_v1
│       └── endpoints
├── core
├── crud
├── db
├── email-templates
│   ├── build
│   └── src
├── schemas
└── tests
    ├── api
    │   └── api_v1
    ├── crud
    └── utils

16 directories
#+end_example

*** Modules

Only these =__init__.py= module specs are non-empty

#+begin_src sh :results output :dir (identity py-proj-root)
find ./src/backend/ -name "__init__.py" -type f -size +0 -exec ls \{\} +
#+end_src

#+RESULTS:
: ./src/backend/app/app/crud/__init__.py
: ./src/backend/app/app/schemas/__init__.py

These modules are defined

#+begin_src sh :results output :dir (identity py-proj-root)
# I thought find couldn't do this ... glad i looked
cd src/backend/app
find . -name "__init__.py" -type f -exec ls \{\} \; | sed -e 's/\/__init__.py//'
#+end_src

#+RESULTS:
#+begin_example
./app
./app/api
./app/api/api_v1
./app/api/api_v1/endpoints
./app/core
./app/crud
./app/db
./app/schemas
./app/tests
./app/tests/api
./app/tests/api/api_v1
./app/tests/crud
./app/tests/utils
#+end_example

**** Engine

The engine (or database connection) is defined here

#+begin_src sh :results output :dir (identity py-proj-root)
find . -name "*engine*" -print -exec cat \{\} +
#+end_src

#+RESULTS:
: ./src/backend/app/app/db/engine.py
: from sqlmodel import create_engine
:
: from app.core.config import settings
:
: engine = create_engine(settings.SQLALCHEMY_DATABASE_URI)

The =SQLALCHEMY_DATABASE_URI= is referenced in these files:

#+begin_src sh :results output :dir (identity py-proj-root)
grep -nre "SQLALCHEMY_DATABASE_URI"
#+end_src

#+RESULTS:
: src/backend/app/app/core/config.py:40:    SQLALCHEMY_DATABASE_URI: Optional[PostgresDsn] = None
: src/backend/app/app/core/config.py:42:    @validator("SQLALCHEMY_DATABASE_URI", pre=True)
: src/backend/app/app/db/engine.py:5:engine = create_engine(settings.SQLALCHEMY_DATABASE_URI)

**** Migrations

#+begin_src sh :results output :dir (identity py-proj-root)
ls ./src/backend/app/alembic.ini
tree ./src/backend/app/alembic
#+end_src

#+RESULTS:
: ./src/backend/app/alembic.ini
: ./src/backend/app/alembic
: ├── env.py
: ├── README
: ├── script.py.mako
: └── versions
:     └── e2412789c190_initialize_models.py
:
: 2 directories, 4 files

Migrations are not strictly necessary. To avoid them,

+ uncomment =Base.metadata.create_all(bind=engine)= in =app.db.init_ib=
+ comment the relevant line in the =prestart.sh=
+ the =src/README.md= file tells you this... (but i guess i didn't see it)

The =app.db.init_db= module is referenced in =app.initial_data= which can run as
a standalone script -- the module name as no other references except
=./src/backend/app/prestart.sh=

